" COMMONWEALTH  vs.  JOSHUA EDWARDS.","Constitutional Law
 Search and seizure
 Investigatory stop
 Reasonable suspicion. Search and Seizure
 Motor vehicle
 Threshold police inquiry
 Reasonable suspicion. Threshold Police Inquiry. Firearms. Alcoholic Liquors
 Possession of opened bottle. Beverage Containers.\nA Superior Court judge erred in allowing the criminal defendant\u0092s pretrial motion to suppress evidence seized from the motor vehicle he had been driving
 where
 at the moment of seizure
 which occurred when a police officer activated his cruiser\u0092s blue lights and blocked the egress of the defendant\u0092s vehicle [345]
 the officer had minimally sufficient facts to establish a reasonable suspicion that the defendant was engaged in criminal activity
 based on a report of the defendant holding a gun early in the morning on a deserted residential street from a witness whose basis of knowledge had been established
 in combination with the defendant\u0092s conduct and in light of the officer\u0092s experience [345-347]; further
 the officer\u0092s actions were reasonably related in scope to the circumstances that justified the interference in the first place
 and other police officers properly escalated their response in proportion to the defendant\u0092s actions following the initial seizure that increased the degree of reasonable suspicion [347-349].","\nThe defendant
 Joshua Edwards
 has been indicted for multiple offenses
 including firearms offenses
 with which he was initially charged following the seizure and search of a motor vehicle he had been driving.  Before trial
 he moved to suppress evidence seized during the search of the vehicle
 invoking the\nPage 342\nFourth Amendment to the United States Constitution and art. 14 of the Massachusetts Declaration of Rights.  After an evidentiary hearing
 a Superior Court judge allowed the defendant's motion.  A single justice of this court allowed the Commonwealth leave to pursue an interlocutory appeal and reported the case to the Appeals Court.  See Mass. R. Crim. P. 15 (a) (2)
 as appearing in  422 Mass. 1501  (1996).  The Appeals Court reversed in an unpublished memorandum and order issued pursuant to its rule 1:28.  Commonwealth v. Edwards
 87 Mass. App. Ct. 1133  (2015).  We granted the defendant's application for further appellate review.  Recognizing that this is an exceedingly close case
 we conclude that the stop was predicated on reasonable suspicion of criminal activity and therefore reverse the motion judge's order allowing the motion to suppress.\nFactual background.  One witness
 Boston police Officer David Lanteigne
 testified at the hearing on the motion to suppress.  In addition
 a number of photographs
 documents
 and police radio transmissions
 as well as a recording of a 911 call
 were received in evidence.  In reviewing a judge's decision on a motion to suppress
 we \"accept the judge's subsidiary findings of fact absent clear error
 but conduct an independent review of the judge's ultimate findings and conclusions of law.\"  Commonwealth v. Washington
\n
 480 (2007).  Without \"detract[ing] from the judge's ultimate findings
\" Commonwealth v. Jessup
\n
 127-128 (2015)
 we supplement his factual findings with \"evidence from the record that 'is uncontroverted and undisputed and where the judge explicitly or implicitly credited the witness's testimony'\" (citation omitted).  Commonwealth v. Jones-Pannell
\n
 431 (2015).\n\nOn March 17
 2013
 at approximately 1:30 A.M.
 the Boston police received a 911 call.\nThe caller identified himself by name
 Jabari Wattley
 and told the operator that he could see a man\nPage 343\nstanding in the street holding a gun.  Wattley further stated that he had seen the man drive off in a black Infiniti motor vehicle
 return and park on Armandine Street (in the Dorchester section of Boston)
 get out of the vehicle holding a gun in his hand
 and then get back into the vehicle.\nHe informed the operator that he knew the man
 identified him as the defendant
 Joshua Edwards
 and said that Edwards was not threatening anyone.\nThe police dispatcher broadcast the information as a \"Priority 1\" call
 requesting \"any unit nearby\" to respond to the address.  A call coded as \"Priority 1\" \"means that it was of a serious nature and that response time and protecting officer safety were both high priorities.\"  A marked cruiser driven by Lanteigne arrived on Armandine Street shortly after the broadcast.\nThe cruiser did not have its emergency lights activated.  Lanteigne stopped when a man (later identified as Wattley) ran off his porch toward the cruiser and began \"yelling\" to Lanteigne and pointing at a black Acura motor vehicle that was parked twenty to thirty feet in front of the cruiser
 on the right hand side of the street.\n\nThe Acura was legally parked very close to the curb
 and was completely dark; no interior or external lights were on.  Another vehicle was parked in front of the Acura
 but the space or spaces behind it were empty.  At that point
 Lanteigne observed the Acura's brake lights illuminate
 and Wattley yelled something to the effect of
 \"That's him.  That's the guy
 he's about to drive away.\"  In response
 Lanteigne activated the cruiser's blue lights
 strobe lights
 and other lights
 and moved the cruiser alongside the driver's side of the Acura in order to block the vehicle from\nPage 344\nleaving.  Lanteigne believed \"the Acura was about to drive away . . . [and] understood that the person Wattley had seen with a handgun was driving the Acura.\"\nLanteigne got out of the cruiser and removed his firearm from its holster.  At the same time
 the defendant got out of the Acura and closed the door.  He \"appeared to take no notice of and pay no attention to\" Lanteigne
 and started to walk away.  Lanteigne responded by running to the front of his cruiser and ordering the defendant to stop.  When the defendant turned and started walking away quickly
 the officer holstered his own weapon
 pushed the defendant against the rear of the Acura
 forced him to the ground when he resisted being pushed
 and handcuffed him.\nAnother police officer who had responded to the scene stood immediately next to the closed driver's side door of the Acura
 and leaned toward the window.  He observed a firearm lying on the floor by the driver's seat.\nIf the defendant had been seated in the vehicle
 \"his legs would have completely hidden the gun from view.\"\nThe police determined that the defendant did not have a Massachusetts driver's license
 and that he was not the registered owner of the Acura.  The police decided to tow the vehicle because a person having lawful control of the vehicle was not present
 and because there had been vandalism in the area.  Prior to the tow
 the vehicle was searched pursuant to an inventory policy.  In addition to the firearm
 the police found an open bottle of beer
 a cup containing what appeared to be an alcoholic beverage in the console next to the driver's seat
 and a closed
 full bottle of beer.\nSuppression ruling.  The motion judge allowed the motion to suppress because he concluded that
 at the time Lanteigne stopped and seized the Acura vehicle -- identified by the judge as the moment when Lanteigne activated his cruiser's blue lights and blocked the Acura from leaving -- the police lacked a reasonable
 articulable suspicion that criminal activity was afoot.\nSee Commonwealth v. Alvarado
\n
 268 & n.3 (1996)
 citing Terry v. Ohio
 392 U.S. 1 (1968).  The judge emphasized that it is not unlawful to carry a gun in public; it is only\nPage 345\nillegal to do so without a license.  The judge concluded that a report of a man holding an unholstered gun on a public sidewalk
 late at night in a high crime area
 was not sufficiently suspicious to warrant an investigatory stop.  He therefore ordered that the evidence discovered in the vehicle be suppressed.\nDiscussion.  We agree with the motion judge that the determinative issue in this case is whether the initial stop of the Acura was predicated on \"reasonable suspicion
 based on specific
 articulable facts and reasonable inferences therefrom
 that an occupant  of the . . . motor vehicle had committed
 was committing
 or was about to commit a crime.\"  Alvarado
 426 Mass. at 268.  See Commonwealth v. Wilson
\n
 394 (2004).  See also Terry
 392 U.S. at 21-22.\nBreaking down the inquiry into its component parts
 we consider when the stop and seizure occurred
 whether the stop was supported by reasonable suspicion
 and whether the scope of the ensuing search was proportional to the degree of suspicion that prompted it.\n1.  Moment of seizure.  Like the motion judge
 we conclude that the defendant clearly was stopped and seized in the constitutional sense when Lanteigne activated his cruiser's blue lights and blocked the Acura's egress.  See Commonwealth v. Thompson
\n
 733
 cert. denied
 525 U.S. 1008 (1998).  Viewed objectively
 at that moment
 a reasonable person would not have believed that he was free to leave the scene.  See Commonwealth v. Barros
\n
 173-174 (2001); Commonwealth v. Smigliano
\n
 491 (1998).\n2.  Reasonable suspicion to initiate stop.  Under the principles of Terry
 392 U.S. at 21-22
 a police officer may stop a person to make a \"threshold inquiry where suspicious conduct gives the officer reason to suspect that a person has committed
 is committing
 or is about to commit a crime.\"  Commonwealth v. Silva
\n
 405 (1974).  An officer's suspicion must be grounded in \"'specific
 articulable facts and reasonable inferences [drawn] therefrom' rather than on a 'hunch'\" (citation omitted).  Commonwealth v. Lyons
\n
 19 (1990).  In this case
 the stop was predicated primarily on the information contained in the police broadcast.  That information was provided by a person who both identified himself and said he personally had seen the defendant with a gun at 1:30 A.M. on a deserted
 residential street.  He identified the defendant by name; explained that he knew the defendant; met the police officer
 Lanteigne
 at the address he had provided to the 911 dispatcher; and pointed out the defendant's\nPage 346\nvehicle to Lanteigne.\nIn these circumstances
 Wattley's basis of knowledge was established
 and his report of seeing the defendant holding a firearm \"could be regarded as reliable without any prior demonstration of his reliability.\"  Commonwealth v. Gouse
\n
 793 (2012)
 quoting Commonwealth v. Bowden
\n
 477 (1980) (distinguishing reports of anonymous informants from those of \"bystanders
 victims and participants\").\nAlthough Wattley did not describe the firearm to the 911 dispatcher -- and
 as the motion judge observed
 there is nothing illegal about merely possessing an appropriately licensed gun -- there was more to the 911 call and Wattley's description of the defendant's behavior than mere possession of a gun.\nAs Wattley reported
 the defendant drove away and then came back to Armandine Street; he got out of the vehicle and stood outside while holding a gun -- apparently in his open hand
 because Wattley reported seeing the weapon; the defendant returned the firearm to the vehicle before entering the vehicle himself; and he then sat alone in the vehicle with all of its lights off.  These facts
 coupled with the time (approximately 1:30 A.M.)
 the location (a deserted street in a residential area
 \"within a few blocks\" of which there had been repeated crimes of violence
 including gun violence and homicides)
 and the officer's belief that \"trained
 licensed owners of a handgun typically carry their firearm in a holster
\"\ncombine to create a scenario that an experienced police officer could reasonably believe is more consistent with likely\nPage 347\ncriminal activity than it is with lawful possession of a firearm.  Although
 unlike Commonwealth v. Haskell
\n
 791
 794 (2003)
 the defendant was not observed loading the gun
 the facts just described concerning the time of night
 the location
 and the defendant's conduct in driving away and returning and
 more particularly
 in his handling of the gun as he got out of and then reentered the Acura
 were collectively significant.\nWhen these facts are considered together and in light of Lanteigne's police experience
 they are sufficient to establish
 even if just barely
 the requisite nexus to suspected criminal activity to warrant an investigatory stop
 because the officer \"could reasonably infer from the conjunction of these facts that criminal activity might be afoot.\"  Thompson
 427 Mass. at 734.  See id. (vehicle double-parked in front of townhouse that was subject of narcotics investigation
 late at night
 with engine running
 in high crime area); Commonwealth v. Almeida
\n
 271-272 (1977) (reasonable suspicion present where defendant was sitting alone in automobile in high crime area late at night
 with its engine running and lights off).\nContrast Couture
 407 Mass. at 183 (in absence of other factors
 \"mere possession of a handgun was not sufficient to give rise to a reasonable suspicion that the defendant was illegally carrying that gun\").\n3.  Scope of search.  Not only was the decision to make an investigatory stop objectively reasonable
 but the officer's actions were \"reasonably related in scope to the circumstances which justified the interference in the first place.\"  Commonwealth v. Borges
\n
 793 (1985)
 quoting Terry
 392 U.S. at 20.  See Commonwealth v. Moses
\n
 141 (1990) (once investigative circumstances for stop are established
 \"[t]he pertinent inquiry is whether the degree of intrusion is reasonable in the circumstances\").  When Lanteigne saw the Acura's brake lights illuminate
 he \"feared that the Acura was about to drive away.\"  Activating the cruiser's emergency lights and blocking the Acura's egress were reasonably prudent protective measures that were proportional to the degree of suspicion that prompted the stop.  See Moses
 supra (\"common knowledge that a person who wants to avoid police questioning
 very often will recklessly drive away
 resulting in serious injury to the police and bystanders\").\nPage 348\nThe defendant's actions following the initial seizure of the Acura increased the degree of reasonable suspicion
 and the police response properly escalated in proportion to it.  See Commonwealth v. Sinforoso
\n
 323 (2001) (\"conduct of the officers was proportional to the escalating suspicion that emerged over the course of the stop\").  See also Haskell
 438 Mass. at 794.  At the time of the stop
 Lanteigne was alone
 very late at night
 on a deserted street in an area that he knew from his police experience had been the site of repeated incidents involving the use of guns as well as homicides and other violent crimes.  He was aware of Wattley's report that the defendant was armed
 that he had left the scene and then returned
 and that he had held the weapon openly on the residential street before concealing its presence by returning it to the vehicle.  Those facts properly were \"considered as part of the aggregate circumstances that provide reasonable suspicion to justify a protective frisk.\"  Commonwealth v. Gomes
\n
 512 (2009).  See Wilson
 441 Mass. at 394-395.  See also Sinforoso
 supra at 325.  If the defendant had remained seated in the vehicle
 the officer would have been warranted in ordering him from the vehicle to conduct that patfrisk.  See Commonwealth v. Robbins
\n
 151 (1990) (protective measures may include protective frisk and minimal search of interior of vehicle).\nThe defendant did not
 however
 remain in the vehicle.  Instead
 after the cruiser's blue lights and strobe lights had been activated and the cruiser had pulled along the driver's side of the Acura
 the defendant get out of the vehicle and \"appeared to take no notice of and pay no attention to Lanteigne and started to walk away\u0094; he disregarded the officer's order to stop
 and turned and began to walk quickly in a different direction.  Because the defendant resisted the officer's attempts to stop him
 the officer was warranted in physically restraining him to further the investigation.  See Commonwealth v. Williams
\n
 119 (1996) (\"restraint
 . . . limited in duration and necessary to complete the [investigatory] inquiry
 does not turn a valid investigatory stop into an unlawful arrest\").  See also Commonwealth v. Torres
\n
 162 (1997) (limited restraint for purposes of threshold inquiry permissible where commensurate with purpose of stop).\nWhile Lanteigne was occupied with the defendant
 another officer
 who had arrived on the scene and was standing outside the defendant's vehicle
 observed a gun on the floor of the Acura near the driver's seat.  For essentially the same reason that Lanteigne\nPage 349\nwas justified in frisking the defendant
 and in light of the defendant's actions after the initial stop
 the police were entitled to determine \"whether the object was
 in fact
 a weapon which could be used against them.  The [officers] were not required to gamble with their personal safety.\"  Robbins
 407 Mass. at 152.  See Sinforoso
 434 Mass. at 324 (actions of police officers in entering automobile to retrieve discovered weapons was reasonable for officer safety); Silva
 366 Mass. at 408 (\"a Terry type of search may extend into the interior of an automobile so long as it is limited in scope to a protective end\").  Although the defendant was not in the vehicle at the time the gun was observed
 \"like the defendant in Silva
 [supra
] he was not under arrest at the time of the 'pat-down' search of his person
 and there was no assurance that he would not be returning promptly to his seat behind the wheel of the automobile.\"  Almeida
 373 Mass. at 272.  In the circumstances
 the police intrusion into the vehicle was reasonably justified in scope.\nOnce the police lawfully had access to the vehicle
 under the plain view doctrine
 additional items could be seized
 provided the incriminating character was apparent.  See
 e.g.
 Commonwealth v. Santana
\n
 211 (1995).  In this case
 two open containers of what appeared to be alcoholic beverages were seized from the center console.  The incriminating character of these open containers was apparent.  See Commonwealth v. Johnson
\n
 50 n.7 (2011) (\"possession of an open container of alcohol in a motor vehicle is a misdemeanor\"); G. L. c. 90
 § 24I (open container law).\nWe conclude that seizure of the items contained in the vehicle was constitutionally permissible.\n\nConclusion.  Considered collectively
 the articulable facts in this case combine to establish a reasonable suspicion of criminal\nPage 350\nactivity before the defendant was stopped and seized
 albeit with the very narrowest of margins.  Objectively
 the police officer could consider the behavior reported
 the weapon identified
 the time of night
 and the characteristics of the location
 and reasonably suspect that the sum of these activities equated to criminality.  The order allowing the motion to suppress is vacated
 and a new order is to be entered denying the motion.  The case is remanded to the Superior Court for further proceedings consistent with this opinion.\nSo ordered.",null,null